
. 
. version 13

. 
. set seed 0193284710

. use collapsed, clear

. 
. qui regress hasinsurance selfemployed post post_self, cluster(year)

. boottest post_self=.04, weight(webb) nogr

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by year, Webb weights:
  post_self=.04

                            t(7) =     2.0194
                        Prob>|t| =     0.0921

95% confidence set for null hypothesis expression: [.03773, .07035]

. boottest post_self=.04, weight(webb) reps(9999999) noci

Wild bootstrap-t, null imposed, 9999999 replications, Wald test, bootstrap clustering by year, Webb weights:
  post_self=.04

                            t(7) =     2.0194
                        Prob>|t| =     0.0758

. boottest post_self=.04, weight(normal) reps(9999) noci

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by year, Normal weights:
  post_self=.04

                            t(7) =     2.0194
                        Prob>|t| =     0.0647

. boottest post_self=.04, weight(gamma) reps(9999) noci svv

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by year, Gamma weights:
  post_self=.04

                            t(7) =     2.0194
                        Prob>|t| =     0.0667

. boottest post_self=.04, weight(mammen) reps(9999) noci

Warning: with 8 bootstrap clusters, the number of replications, 9999, exceeds the universe of Mammen draws, 2^8 = 256. 
Consider Webb weights instead, using weight(webb).

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by year, Mammen weights:
  post_self=.04

                            t(7) =     2.0194
                        Prob>|t| =     0.1009

. boottest post_self=.04, weight(mammen) reps(9999) boottype(score) nogr

Warning: with 8 bootstrap clusters, the number of replications, 9999, exceeds the universe of Mammen draws, 2^8 = 256. 
Consider Webb weights instead, using weight(webb).

Score bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by year, Mammen weights:
  post_self=.04

                            t(7) =     1.8479
                        Prob>|t| =     0.0855

95% confidence set for null hypothesis expression: [.02898, .03173] U [.03421, .07621]

. 
. qui regress hasinsurance selfemployed post post_self, robust

. boottest post_self=.04, weight(webb) nogr

Wild bootstrap-t, null imposed, 999 replications, Wald test, Webb weights:
  post_self=.04

                           t(12) =     1.5097
                        Prob>|t| =     0.1652

95% confidence set for null hypothesis expression: [.03194, .0797]

. 
. qui regress hasinsurance selfemployed post post_self, cluster(year)

. boottest (post_self=.05) (post=-.02), reps(9999) weight(webb) nogr

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by year, Webb weights:
  post_self=.05
  post=-.02

                   F(2, 7) =     0.3383
                  Prob > F =     0.8258

. boottest (post_self=.05) (post=-.02) (selfemployed=-.15), reps(9999) weight(webb) nogr

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by year, Webb weights:
  post_self=.05
  post=-.02
  selfemployed=-.15

                   F(3, 7) =     0.8534
                  Prob > F =     0.7587

. 
. qui regress hasinsurance selfemployed post post_self

. boottest post_self=.04, weight(webb) nogr

Wild bootstrap-t, null imposed, 999 replications, Wald test, Webb weights:
  post_self=.04

                           t(12) =     1.5215
                        Prob>|t| =     0.1872

95% confidence set for null hypothesis expression: [.03346, .07848]

. boottest (post_self=.05) (post=-.02), reps(9999) weight(webb) nogr

Wild bootstrap-t, null imposed, 9999 replications, Wald test, Webb weights:
  post_self=.05
  post=-.02

                  F(2, 12) =     0.1895
                  Prob > F =     0.8024

. scoretest (post_self=.05), nogr

Rao score (Lagrange multiplier) test:
  post_self=.05

                           t(12) =     0.4924
                        Prob>|t| =     0.6313

95% confidence set for null hypothesis expression: [.02749, .08223]

. scoretest (post_self=.05) (post=-.02), nogr

Rao score (Lagrange multiplier) test:
  post_self=.05
  post=-.02

                  F(2, 12) =     0.1837
                  Prob > F =     0.8345

. boottest (post_self=.08), boottype(score) reps(9999) nogr

Score bootstrap-t, null imposed, 9999 replications, Wald test, Rademacher weights:
  post_self=.08

                           t(12) =    -2.0664
                        Prob>|t| =     0.0200

95% confidence set for null hypothesis expression: [.03555, .07487]

. boottest (post_self=.05) (post=-.02), boottype(score) reps(9999) nogr

Score bootstrap-t, null imposed, 9999 replications, Wald test, Rademacher weights:
  post_self=.05
  post=-.02

                  F(2, 12) =     0.1837
                  Prob > F =     0.7728

. 
. use d:\OneDrive\Documents\Macros\nlsw88, clear
(NLSW, 1988 extract)

. constraint 1 ttl_exp = .2

. qui cnsreg wage tenure ttl_exp collgrad, constr(1) cluster(industry)

. boottest tenure, nogr

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                           t(11) =     2.1254
                        Prob>|t| =     0.0020

95% confidence set for null hypothesis expression: [.008795, .234]

. 
. keep if e(sample)
(29 observations deleted)

. gen id = _n - cond(_n>1000, 1000, 0)

. qui cnsreg wage tenure ttl_exp collgrad, constr(1) cluster(id)  // granular but not pure robust

. boottest tenure, reps(9999) nogr

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by id, Rademacher weights:
  tenure

                         t(1216) =     3.3434
                        Prob>|t| =     0.0009

95% confidence set for null hypothesis expression: [.02673, .1038]

. 
. qui areg wage tenure ttl_exp collgrad, cluster(id) a(industry)

. boottest tenure, reps(9999) nogr

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by id, Rademacher weights:
  tenure

                         t(1216) =     0.7606
                        Prob>|t| =     0.4498

95% confidence set for null hypothesis expression: [-.02773, .06341]

. 
. use d:\OneDrive\Documents\Macros\nlsw88, clear
(NLSW, 1988 extract)

. qui ivregress liml wage ttl_exp collgrad (tenure = union), cluster(industry)

. boottest tenure, ptype(equaltail) reps(9999) nogr

Warning: with 12 bootstrap clusters, the number of replications, 9999, exceeds the universe of Rademacher draws, 2^12 = 4096. Sampling each once.
Consider Webb weights instead, using weight(webb).

Wild bootstrap-t, null imposed, 4096 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                               z =     2.6040
    2 * min(Prob>|z|, Prob<-|z|) =     0.0444

95% confidence set for null hypothesis expression: [.1188, 2.21]

. boottest tenure, nonull reps(99999) matsize(.1) nogr

Warning: with 12 bootstrap clusters, the number of replications, 99999, exceeds the universe of Rademacher draws, 2^12 = 4096. Sampling each once.
Consider Webb weights instead, using weight(webb).

Wild bootstrap-t, null not imposed, 4096 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                               z =     2.6040
                        Prob>|z| =     0.0000

95% confidence set for null hypothesis expression: [.2193, 1.253]

. boottest tenure, ptype(upper) svmat(t) reps(9999) nogr

Warning: with 12 bootstrap clusters, the number of replications, 9999, exceeds the universe of Rademacher draws, 2^12 = 4096. Sampling each once.
Consider Webb weights instead, using weight(webb).

Wild bootstrap-t, null imposed, 4096 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                               z =     2.6040
                          Prob>z =     0.0222

95% confidence set for null hypothesis expression: [.2769, .]

. boottest tenure, ptype(lower) svmat(numer) reps(9999) nogr

Warning: with 12 bootstrap clusters, the number of replications, 9999, exceeds the universe of Rademacher draws, 2^12 = 4096. Sampling each once.
Consider Webb weights instead, using weight(webb).

Wild bootstrap-t, null imposed, 4096 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                               z =     2.6040
                          Prob<z =     0.9775

95% confidence set for null hypothesis expression: [., 1.793]

. 
. qui ivregress liml wage ttl_exp collgrad (tenure = union), cluster(industry)

. boottest tenure, ptype(equaltail) reps(9999) nogr

Warning: with 12 bootstrap clusters, the number of replications, 9999, exceeds the universe of Rademacher draws, 2^12 = 4096. Sampling each once.
Consider Webb weights instead, using weight(webb).

Wild bootstrap-t, null imposed, 4096 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                               z =     2.6040
    2 * min(Prob>|z|, Prob<-|z|) =     0.0444

95% confidence set for null hypothesis expression: [.1188, 2.21]

. 
. qui ivregress liml wage ttl_exp collgrad (tenure = union) if industry<., robust

. boottest tenure, ptype(equaltail) reps(99) noci

Wild bootstrap-t, null imposed, 99 replications, Wald test, Rademacher weights:
  tenure

                               z =     3.5823
    2 * min(Prob>|z|, Prob<-|z|) =     0.0000

. 
. qui ivregress liml wage ttl_exp collgrad (tenure = union) if industry<., robust

. boottest tenure, ptype(equaltail) reps(99) noci

Wild bootstrap-t, null imposed, 99 replications, Wald test, Rademacher weights:
  tenure

                               z =     3.5823
    2 * min(Prob>|z|, Prob<-|z|) =     0.0000

. boottest collgrad tenure, ptype(equaltail) reps(99) noci
Note: ptype(equaltail) ignored for multi-constraint null hypotheses.

Wild bootstrap-t, null imposed, 99 replications, Wald test, Rademacher weights:
  collgrad tenure

                   chi2(2) =   139.0793
               Prob > chi2 =     0.0000

. 
. qui ivregress 2sls wage ttl_exp collgrad (tenure = union) if industry<.

. boottest tenure, ptype(equaltail) reps(99) noci

Wild bootstrap-t, null imposed, 99 replications, Wald test, Rademacher weights:
  tenure

                               z =   160.7675
    2 * min(Prob>|z|, Prob<-|z|) =     0.0000

. boottest tenure collgrad, ptype(equaltail) reps(99) noci
Note: ptype(equaltail) ignored for multi-constraint null hypotheses.

Wild bootstrap-t, null imposed, 99 replications, Wald test, Rademacher weights:
  tenure collgrad

                   chi2(2) =  3.120e+05
               Prob > chi2 =     0.0000

. 
. qui ivregress 2sls wage ttl_exp collgrad (tenure = union), cluster(industry)

. boottest tenure, ptype(equaltail) weight(webb) stat(c) gridmin(-5) gridmax(5) gridpoints(100) nogr

Wild bootstrap-c, null imposed, 999 replications, Wald test, bootstrap clustering by industry, Webb weights:
  tenure

                               z =     1.6206
    2 * min(Prob>|z|, Prob<-|z|) =     0.1061

95% confidence set for null hypothesis expression: [., .]
(A confidence interval could not be bounded. Try widening the search range with the gridmin() and gridmax() options.)
Note: denominator for z statistic computed from the bootstrap replications of the numerator.

. boottest tenure, ptype(equaltail) weight(webb) stat(c) gridmin(-5) gridmax(5) gridpoints(100) matsize(.01) nogr

Wild bootstrap-c, null imposed, 999 replications, Wald test, bootstrap clustering by industry, Webb weights:
  tenure

                               z =     1.6495
    2 * min(Prob>|z|, Prob<-|z|) =     0.1241

95% confidence set for null hypothesis expression: [., .]
(A confidence interval could not be bounded. Try widening the search range with the gridmin() and gridmax() options.)
Note: denominator for z statistic computed from the bootstrap replications of the numerator.

. 
. qui ivregress 2sls wage ttl_exp collgrad (tenure = union) if industry<., robust

. boottest tenure, ptype(equaltail) matsize(.005) noci weight(webb)

Wild bootstrap-t, null imposed, 999 replications, Wald test, Webb weights:
  tenure

                               z =     3.5823
    2 * min(Prob>|z|, Prob<-|z|) =     0.0000

. 
. preserve

. keep if e(sample)
(391 observations deleted)

. gen id = _n - cond(_n>1000, 1000, 0)

. boottest tenure, cluster(id) ptype(equaltail) matsize(.005) noci weight(webb)

Overriding estimator's cluster/robust settings with cluster(id)

Wild bootstrap-t, null imposed, 999 replications, Wald test, clustering by id, bootstrap clustering by id, Webb weights:
  tenure

                               z =     3.5883
    2 * min(Prob>|z|, Prob<-|z|) =     0.0000

. restore

. 
. qui ivregress 2sls wage ttl_exp collgrad (tenure = union), cluster(industry)

. boottest, ar nogr

Wild bootstrap-t, null imposed, 999 replications, Anderson-Rubin Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                               z =     2.4454
                        Prob>|z| =     0.0330

95% confidence set for null hypothesis expression: [.04746, 1.267]

. boottest, ar nonull nogr

Wild bootstrap-t, null not imposed, 999 replications, Anderson-Rubin Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                               z =     2.4454
                        Prob>|z| =     0.0340

95% confidence set for null hypothesis expression: [.06103, 1.411]

. scoretest tenure, nogr

Rao score (Lagrange multiplier) test:
  tenure

                               z =     2.3279
                        Prob>|z| =     0.0199

95% confidence set for null hypothesis expression: [.1367, 1.324]

. waldtest tenure, ptype(upper) nogr

Wald test:
  tenure

                               z =     2.6040
                          Prob>z =     0.0046

95% confidence set for null hypothesis expression: [.182, 1.29]

. 
. qui ivregress liml wage (tenure = collgrad ttl_exp), cluster(industry)

. boottest tenure, nogr

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                               z =     7.5847
                        Prob>|z| =     0.0040

95% confidence set for null hypothesis expression: [.3332, .8016]

. 
. qui ivreg2 wage collgrad smsa race age (tenure = union married), cluster(industry) fuller(1)

. boottest tenure, nograph weight(webb) reps(9999)

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by industry, Webb weights:
  tenure

                               z =     4.0267
                        Prob>|z| =     0.0235

95% confidence set for null hypothesis expression: [-.8798, -.3452] U [.314, 1.243]

. qui gen individual = _n

. boottest tenure, noci bootcluster(individual) weight(webb)

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by individual, Webb weights:
  tenure

                               z =     4.0267
                        Prob>|z| =     0.0060

. boottest tenure, nograph bootcluster(collgrad) cluster(collgrad industry) weight(webb) reps(9999)

Overriding estimator's cluster/robust settings with cluster(collgrad industry)

Warning: 558 replications returned an infeasible test statistic and were deleted from the bootstrap distribution.

Wild bootstrap-t, null imposed, 9999 replications, Wald test, clustering by collgrad industry, bootstrap clustering by collgrad, Webb weights:
  tenure

                               z =     3.9420
                        Prob>|z| =     0.2006

95% confidence set for null hypothesis expression: [., .]
(A confidence interval could not be bounded. Try widening the search range with the gridmin() and gridmax() options.)

. 
. qui areg wage ttl_exp collgrad tenure [aw=hours] if occupation<. & grade<. & union<., cluster(age) absorb(industry)

. boottest tenure, nograph cluster(age occupation) bootcluster(occupation)

Overriding estimator's cluster/robust settings with cluster(age occupation)

Wild bootstrap-t, null imposed, 999 replications, Wald test, clustering by age occupation, bootstrap clustering by occupation, Rademacher weights:
  tenure

                           t(12) =     1.4294
                        Prob>|t| =     0.1421

95% confidence set for null hypothesis expression: [-.01131, .123]

. 
. qui areg wage ttl_exp collgrad tenure if occupation<. & grade<. & union<. & hours<., robust absorb(industry)

. boottest tenure, nograph

Wild bootstrap-t, null imposed, 999 replications, Wald test, Rademacher weights:
  tenure

                         t(1833) =     1.6602
                        Prob>|t| =     0.0821

95% confidence set for null hypothesis expression: [-.00393, .07282]

. 
. qui areg wage ttl_exp collgrad tenure [aw=hours] if occupation<. & grade<. & union<., robust absorb(industry)

. boottest tenure, nograph 

Wild bootstrap-t, null imposed, 999 replications, Wald test, Rademacher weights:
  tenure

                         t(1833) =     1.6265
                        Prob>|t| =     0.0921

95% confidence set for null hypothesis expression: [-.006293, .07481]

. 
. qui ivreghdfe wage ttl_exp collgrad tenure (occupation = union married) [aw=hours] if grade<., liml cluster(industry) absorb(industry)

. boottest tenure, nograph

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                           t(11) =     0.8177
                        Prob>|t| =     0.4194

95% confidence set for null hypothesis expression: [-.02675, .08785]

. boottest occupation, nograph

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  occupation

                           t(11) =     1.5398
                        Prob>|t| =     0.2202

95% confidence set for null hypothesis expression: [., .]
(A confidence interval could not be bounded. Try widening the search range with the gridmin() and gridmax() options.)

. 
. qui ivreghdfe wage ttl_exp collgrad tenure (occupation = union married) [aw=hours] if grade<., liml cluster(industry) absorb(age)

. boottest tenure, nograph

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                           t(11) =     0.6068
                        Prob>|t| =     0.4955

95% confidence set for null hypothesis expression: [-.04385, .08138]

. boottest collgrad tenure,  nograph

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  collgrad tenure

                  F(2, 11) =     3.5295
                  Prob > F =     0.1662

. boottest occupation, gridmin(-1) gridmax(1) nograph

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  occupation

                           t(11) =     1.1091
                        Prob>|t| =     0.1912

95% confidence set for null hypothesis expression: [-.5387, .]
(A confidence interval could not be bounded. Try widening the search range with the gridmin() and gridmax() options.)

. 
. constraint 1 [wage]collgrad

. qui ivreghdfe wage ttl_exp /*collgrad*/ tenure (occupation = union married) [aw=hours], liml cluster(industry) absorb(age)  // approximate contrained LIML with ivreghdfe

. boottest tenure, nograph

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by industry, Rademacher weights:
  tenure

                           t(11) =     0.2684
                        Prob>|t| =     0.7878

95% confidence set for null hypothesis expression: [-.05427, .06868]

. 
. use d:\OneDrive\Documents\Macros\abdata, clear

. qui areg n w k, absorb(ind)

. boottest k, cluster(id year) nograph

Overriding estimator's cluster/robust settings with cluster(id year)
(bootcluster(id year) assumed)

Warning: 34 replications returned an infeasible test statistic and were deleted from the bootstrap distribution.

Wild bootstrap-t, null imposed, 999 replications, Wald test, clustering by id year, bootstrap clustering by id year, Rademacher weights:
  k

                            t(8) =    28.5012
                        Prob>|t| =     0.0021

95% confidence set for null hypothesis expression: [.8455, .8835]

. qui areg n w k [aw=ys], absorb(ind)

. boottest k, cluster(id year) nograph

Overriding estimator's cluster/robust settings with cluster(id year)
(bootcluster(id year) assumed)

Warning: 26 replications returned an infeasible test statistic and were deleted from the bootstrap distribution.

Wild bootstrap-t, null imposed, 999 replications, Wald test, clustering by id year, bootstrap clustering by id year, Rademacher weights:
  k

                            t(8) =    28.4248
                        Prob>|t| =     0.0000

95% confidence set for null hypothesis expression: [.8432, .8846]

. 
. use pixel-level-baseline-final, clear

. global pix lnkm pixpetro pixdia pixwaterd pixcapdist pixmal pixsead pixsuit pixelev pixbdist

. global geo lnwaterkm lnkm2split mean_elev mean_suit malariasuit petroleum diamondd

. global poly capdistance1 seadist1 borderdist1

. qui encode pixwbcode, gen(ccode)  // make numerical country identifier

. qui areg lnl0708s centr_tribe lnpd0 \$pix \$geo \$poly, absorb(ccode)

. boottest centr_tribe, nogr reps(999) clust(ccode pixcluster) bootcluster(ccode)

Overriding estimator's cluster/robust settings with cluster(ccode pixcluster)

Wild bootstrap-t, null imposed, 999 replications, Wald test, clustering by ccode pixcluster, bootstrap clustering by ccode, Rademacher weights:
  centr_tribe

                           t(48) =     3.5211
                        Prob>|t| =     0.0010

95% confidence set for null hypothesis expression: [.0517, .2568]

. boottest centr_tribe, nogr reps(999) clust(ccode pixcluster) bootcluster(pixcluster)

Overriding estimator's cluster/robust settings with cluster(ccode pixcluster)

Wild bootstrap-t, null imposed, 999 replications, Wald test, clustering by ccode pixcluster, bootstrap clustering by pixcluster, Rademacher weights:
  centr_tribe

                           t(48) =     3.5211
                        Prob>|t| =     0.0050

95% confidence set for null hypothesis expression: [.04842, .2608]

. boottest centr_tribe, nogr reps(999) clust(ccode pixcluster) bootcluster(ccode pixcluster)

Overriding estimator's cluster/robust settings with cluster(ccode pixcluster)

Wild bootstrap-t, null imposed, 999 replications, Wald test, clustering by ccode pixcluster, bootstrap clustering by ccode pixcluster, Rademacher weights:
  centr_tribe

                           t(48) =     3.5211
                        Prob>|t| =     0.0050

95% confidence set for null hypothesis expression: [.05552, .2428]

. 
. infile coll merit male black asian year state chst using regm.raw, clear
(42,161 observations read)

. qui regress coll merit male black asian i.year i.state if !inlist(state,34,57,59,61,64,71,72,85,88), cluster(state)     

. generate individual = _n  // unique ID for each observation

. boottest merit, nogr reps(999) gridpoints(10)  // defaults to bootcluster(state)

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by state, Rademacher weights:
  merit

                           t(41) =     6.7127
                        Prob>|t| =     0.4735

95% confidence set for null hypothesis expression: [-2.69, 1.305]

. boottest merit, nogr reps(999) gridpoints(10) nonull

Wild bootstrap-t, null not imposed, 999 replications, Wald test, bootstrap clustering by state, Rademacher weights:
  merit

                           t(41) =     6.7127
                        Prob>|t| =     0.0000

95% confidence set for null hypothesis expression: [.04888, .09546]

. boottest merit, nogr reps(999) gridpoints(10) bootcluster(state year)

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by state year, Rademacher weights:
  merit

                           t(41) =     6.7127
                        Prob>|t| =     0.2763

95% confidence set for null hypothesis expression: [-5.548, 4.981]

. boottest merit, nogr reps(999) gridpoints(10) nonull bootcluster(state year)

Wild bootstrap-t, null not imposed, 999 replications, Wald test, bootstrap clustering by state year, Rademacher weights:
  merit

                           t(41) =     6.7127
                        Prob>|t| =     0.0721

95% confidence set for null hypothesis expression: [-.007313, .1516]

. boottest merit, nogr reps(999) gridpoints(10) bootcluster(individual)

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by individual, Rademacher weights:
  merit

                           t(41) =     6.7127
                        Prob>|t| =     0.4034

95% confidence set for null hypothesis expression: [-.1011, .2514]

. boottest merit, nogr reps(999) gridpoints(10) nonull bootcluster(individual)

Wild bootstrap-t, null not imposed, 999 replications, Wald test, bootstrap clustering by individual, Rademacher weights:
  merit

                           t(41) =     6.7127
                        Prob>|t| =     0.3784

95% confidence set for null hypothesis expression: [-.09429, .2386]

. boottest merit, nogr reps(999) gridpoints(10) nonull bootcluster(individual) matsize(.1)

Wild bootstrap-t, null not imposed, 999 replications, Wald test, bootstrap clustering by individual, Rademacher weights:
  merit

                           t(41) =     6.7127
                        Prob>|t| =     0.3644

95% confidence set for null hypothesis expression: [-.09771, .242]

. 
. qui log close
