
. 
. version 13

. 
. set seed 0193284710

. 
. use collapsed, clear

. 
. qui regress hasinsurance selfemployed post post_self, cluster(year)

. boottest post_self=.04, nogr // wild bootstrap, Rademacher weights, null imposed, 999 replications

Warning: with 8 boostrap clusters, the number of replications, 999, exceeds the universe of Rademacher draws, 2^8 = 256. Sampling each once.
Consider Webb weights instead, using weight(webb).

Wild bootstrap-t, null imposed, 256 replications, Wald test, bootstrap clustering by year, Rademacher weights:
  post_self=.04

                            t(7) =     2.0194
                        Prob>|t| =     0.0742

95% confidence set for null hypothesis expression: [.0384, .07148]

. boottest post_self=.04, weight(webb) noci // wild bootstrap, Webb weights, null imposed, 999 replications, no graph or CI

Wild bootstrap-t, null imposed, 999 replications, Wald test, bootstrap clustering by year, Webb weights:
  post_self=.04

                            t(7) =     2.0194
                        Prob>|t| =     0.0921

. scoretest post_self=.04, nogr                   // Rao score/Lagrange multipler test of same

Rao score (Lagrange multiplier) test:
  post_self=.04

                            t(7) =     1.8479
                        Prob>|t| =     0.1071

95% confidence set for null hypothesis expression: [.03455, .07517]

. 
. boottest post_self post, reps(9999) weight(webb) nogr // wild bootstrap test of joint null, Webb weights, null imposed, 9,999 replications

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by year, Webb weights:
  post_self post

                   F(2, 7) =    72.4798
                  Prob > F =     0.0026

. 
end of do-file

. run "C:\Users\drood\OneDrive\Documents\Macros\boottest\boottest.ado"
